docs/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-02 Wed 20:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ensemble Learning</title>
<meta name="author" content="Tooraj Taraz" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ensemble Learning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org898233b">1. The general idea</a></li>
<li><a href="#orgedf005b">2. How these scripts work?</a>
<ul>
<li><a href="#org7a29182">2.1. Loading data</a>
<ul>
<li><a href="#org95b595f">2.1.1. Needed modules and global variables</a></li>
<li><a href="#org711bf0d">2.1.2. Parsing the arrays in dataset</a></li>
<li><a href="#org0fdfd12">2.1.3. Extracting arrays for parsing</a></li>
<li><a href="#orga6b8696">2.1.4. Loading the dataset</a></li>
</ul>
</li>
<li><a href="#orgd280b75">2.2. Adaboosted Decision Trees</a>
<ul>
<li><a href="#org8541bce">2.2.1. Needed modules and global variables</a></li>
<li><a href="#org86288ea">2.2.2. Initializing global variables</a></li>
<li><a href="#org1cd359c">2.2.3. Initializing the meta classifier</a></li>
</ul>
</li>
<li><a href="#orga5e186e">2.3. Random Forrest</a>
<ul>
<li><a href="#orgee7338b">2.3.1. Needed modules and global variables</a></li>
<li><a href="#orgff51216">2.3.2. Initializing global variables</a></li>
<li><a href="#org081db88">2.3.3. Initializing the meta classifier</a></li>
</ul>
</li>
<li><a href="#org3d3863c">2.4. Bagged MLPs</a>
<ul>
<li><a href="#orgfe4ff2c">2.4.1. Needed modules and global variables</a></li>
<li><a href="#org11076f6">2.4.2. Initializing global variables</a></li>
<li><a href="#orgf7ebd80">2.4.3. Initializing the meta classifier</a></li>
</ul>
</li>
<li><a href="#org7397c33">2.5. Some sort of bootstraping + Soft voting</a>
<ul>
<li><a href="#orge1c281e">2.5.1. Needed modules and global variables</a></li>
<li><a href="#orgd065574">2.5.2. Initializing global variables</a></li>
<li><a href="#org0d0ef9f">2.5.3. The pipeline</a></li>
</ul>
</li>
<li><a href="#org7feaf7f">2.6. The main script</a>
<ul>
<li><a href="#org90e5cf6">2.6.1. Needed modules</a></li>
<li><a href="#org6472582">2.6.2. Loading and manuplating the data</a></li>
<li><a href="#org0cb99e7">2.6.3. Preprocessing data</a></li>
<li><a href="#orgde6b7af">2.6.4. Using what have created so far</a></li>
</ul>
</li>
<li><a href="#org10f14f8">2.7. Results</a>
<ul>
<li><a href="#orgbb31424">2.7.1. Overall view</a></li>
<li><a href="#org741a82b">2.7.2. Detailed discussion</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org898233b" class="outline-2">
<h2 id="org898233b"><span class="section-number-2">1.</span> The general idea</h2>
<div class="outline-text-2" id="text-1">
<p>
The general idea behind ensemble learning is that instead of a specific algorithm for classification, we have a meta classifier that takes advantage of couple of classic classifier.
In this project we have these 4:
</p>
<ol class="org-ol">
<li>Adaboosted decision trees</li>
<li>Random forrest</li>
<li>Bagged MLPs</li>
<li>Some sort of bootstraping + Soft voting</li>
</ol>
<p>
It&rsquo;s worth mentioning that every hard coded parameter is retrieved from previous projects and tests.
</p>
</div>
</div>
<div id="outline-container-orgedf005b" class="outline-2">
<h2 id="orgedf005b"><span class="section-number-2">2.</span> How these scripts work?</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7a29182" class="outline-3">
<h3 id="org7a29182"><span class="section-number-3">2.1.</span> Loading data</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org95b595f" class="outline-4">
<h4 id="org95b595f"><span class="section-number-4">2.1.1.</span> Needed modules and global variables</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">from</span> os.path <span style="color: #c099ff;">import</span> exists, join
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np


<span style="color: #ff98a4;">seprator</span> = <span style="color: #c3e88d;">"\t"</span>
<span style="color: #ff98a4;">dataset_folder</span> = <span style="color: #c3e88d;">"lfw"</span>
<span style="color: #ff98a4;">train_file</span> = <span style="color: #c3e88d;">"pairsDevTrain.txt"</span>
<span style="color: #ff98a4;">test_file</span> = <span style="color: #c3e88d;">"pairsDevTest.txt"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org711bf0d" class="outline-4">
<h4 id="org711bf0d"><span class="section-number-4">2.1.2.</span> Parsing the arrays in dataset</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">parse_array</span>(stringed_array):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">parse the stringed array</span>
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">return the array</span>
    <span style="color: #ff98a4;">result</span> = []
    <span style="color: #c099ff;">for</span> string <span style="color: #c099ff;">in</span> stringed_array:
        <span style="color: #c099ff;">if</span> <span style="color: #c3e88d;">"["</span> <span style="color: #c099ff;">in</span> string:
            <span style="color: #ff98a4;">string</span> = string[<span style="color: #ff995e; font-weight: bold;">2</span>:]
        <span style="color: #c099ff;">if</span> <span style="color: #c3e88d;">"]"</span> <span style="color: #c099ff;">in</span> string:
            <span style="color: #ff98a4;">string</span> = string[:-<span style="color: #ff995e; font-weight: bold;">2</span>]
        <span style="color: #c099ff;">for</span> token <span style="color: #c099ff;">in</span> string.split():
            result.append(<span style="color: #c099ff;">float</span>(token))
    <span style="color: #c099ff;">return</span> np.array(result)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0fdfd12" class="outline-4">
<h4 id="org0fdfd12"><span class="section-number-4">2.1.3.</span> Extracting arrays for parsing</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
We need to figure out path to each txt file in dataset in order to load them as a string and then parse them and load them into memory using previous function.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">extract_array_from_line</span>(path, line):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Name _ Pic.No1 _ Pic.No2</span>
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">extract array from Pics and return them</span>
    <span style="color: #c099ff;">try</span>:
        <span style="color: #ff98a4;">name</span>, <span style="color: #ff98a4;">pic1</span>, <span style="color: #ff98a4;">pic2</span> = line.split(seprator)
        <span style="color: #ff98a4;">pic1</span> = <span style="color: #c099ff;">int</span>(pic1)
        <span style="color: #ff98a4;">pic2</span> = <span style="color: #c099ff;">int</span>(pic2)
        <span style="color: #ff98a4;">pic1</span> = f<span style="color: #c3e88d;">'{name}_{pic1:04d}.txt'</span>
        <span style="color: #ff98a4;">pic2</span> = f<span style="color: #c3e88d;">'{name}_{pic2:04d}.txt'</span>

        <span style="color: #ff98a4;">final_path</span> = join(path, name)
        <span style="color: #ff98a4;">final_pic1</span> = join(final_path, pic1)
        <span style="color: #ff98a4;">final_pic2</span> = join(final_path, pic2)
        <span style="color: #ff98a4;">parsed_pic1</span> = <span style="color: #c099ff;">open</span>(final_pic1, <span style="color: #c3e88d;">'r'</span>).readlines()
        <span style="color: #ff98a4;">parsed_pic2</span> = <span style="color: #c099ff;">open</span>(final_pic2, <span style="color: #c3e88d;">'r'</span>).readlines()


        <span style="color: #ff98a4;">parsed_pic1</span> = parse_array(parsed_pic1)
        <span style="color: #ff98a4;">parsed_pic2</span> = parse_array(parsed_pic2)
        <span style="color: #c099ff;">return</span> np.array([parsed_pic1, parsed_pic2])
    <span style="color: #c099ff;">except</span> <span style="color: #ffc777;">Exception</span>:
        <span style="color: #ff98a4;">name1</span>, <span style="color: #ff98a4;">pic1</span>, <span style="color: #ff98a4;">name2</span>, <span style="color: #ff98a4;">pic2</span> = line.split(seprator)
        <span style="color: #ff98a4;">pic1</span> = <span style="color: #c099ff;">int</span>(pic1)
        <span style="color: #ff98a4;">pic2</span> = <span style="color: #c099ff;">int</span>(pic2)
        <span style="color: #ff98a4;">pic1</span> = f<span style="color: #c3e88d;">'{name1}_{pic1:04d}.txt'</span>
        <span style="color: #ff98a4;">pic2</span> = f<span style="color: #c3e88d;">'{name2}_{pic2:04d}.txt'</span>

        <span style="color: #ff98a4;">final_path1</span> = join(path, name1)
        <span style="color: #ff98a4;">final_path2</span> = join(path, name2)

        <span style="color: #ff98a4;">final_pic1</span> = join(final_path1, pic1)
        <span style="color: #ff98a4;">final_pic2</span> = join(final_path2, pic2)

        <span style="color: #ff98a4;">parsed_pic1</span> = <span style="color: #c099ff;">open</span>(final_pic1, <span style="color: #c3e88d;">'r'</span>).readlines()
        <span style="color: #ff98a4;">parsed_pic2</span> = <span style="color: #c099ff;">open</span>(final_pic2, <span style="color: #c3e88d;">'r'</span>).readlines()


        <span style="color: #ff98a4;">parsed_pic1</span> = parse_array(parsed_pic1)
        <span style="color: #ff98a4;">parsed_pic2</span> = parse_array(parsed_pic2)
        <span style="color: #c099ff;">return</span> np.array([parsed_pic1, parsed_pic2])
</pre>
</div>
</div>
</div>
