docs/documentation.html
<div id="outline-container-orga6b8696" class="outline-4">
<h4 id="orga6b8696"><span class="section-number-4">2.1.4.</span> Loading the dataset</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Now we use all the functions above to load our dataset.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">load</span>(path):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">check if the file exists</span>
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">if not, return None</span>
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">if yes, load the data</span>
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">return the data</span>
    <span style="color: #c099ff;">if</span> <span style="color: #c099ff;">not</span> exists(path):
        <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">None</span>

    <span style="color: #ff98a4;">data_path</span> = join(path, dataset_folder)
    <span style="color: #ff98a4;">train_path</span> = join(path, train_file)
    <span style="color: #ff98a4;">test_path</span> = join(path, test_file)
    <span style="color: #ff98a4;">train_data_plus</span> = []
    <span style="color: #ff98a4;">test_data_plus</span> = []
    <span style="color: #ff98a4;">train_data_negative</span> = []
    <span style="color: #ff98a4;">test_data_negative</span> = []
    <span style="color: #ff98a4;">train_path_handle</span> = <span style="color: #c099ff;">open</span>(train_path, <span style="color: #c3e88d;">'r'</span>)
    <span style="color: #ff98a4;">test_path_handle</span> = <span style="color: #c099ff;">open</span>(test_path, <span style="color: #c3e88d;">'r'</span>)

    <span style="color: #c099ff;">for</span> i, line <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">enumerate</span>(train_path_handle.readlines()):
        <span style="color: #c099ff;">if</span> i == <span style="color: #ff995e; font-weight: bold;">0</span>:
            <span style="color: #ff98a4;">count</span> = <span style="color: #c099ff;">int</span>(line)
            <span style="color: #c099ff;">continue</span>
        <span style="color: #c099ff;">if</span> i &lt;= count:
            train_data_plus.append(extract_array_from_line(data_path, line))
        <span style="color: #c099ff;">else</span>:
            train_data_negative.append(extract_array_from_line(data_path, line))

    <span style="color: #c099ff;">for</span> i, line <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">enumerate</span>(test_path_handle.readlines()):
        <span style="color: #c099ff;">if</span> i == <span style="color: #ff995e; font-weight: bold;">0</span>:
            <span style="color: #ff98a4;">count</span> = <span style="color: #c099ff;">int</span>(line)
            <span style="color: #c099ff;">continue</span>
        <span style="color: #c099ff;">if</span> i &lt;= count:
            test_data_plus.append(extract_array_from_line(data_path, line))
        <span style="color: #c099ff;">else</span>:
            test_data_negative.append(extract_array_from_line(data_path, line))

    <span style="color: #c099ff;">return</span> np.array(train_data_plus), np.array(train_data_negative), np.array(test_data_plus), np.array(test_data_negative)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd280b75" class="outline-3">
<h3 id="orgd280b75"><span class="section-number-3">2.2.</span> Adaboosted Decision Trees</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Sklearn&rsquo;s implementation of all meta classifiers is used in this project.
</p>
</div>
<div id="outline-container-org8541bce" class="outline-4">
<h4 id="org8541bce"><span class="section-number-4">2.2.1.</span> Needed modules and global variables</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">from</span> sklearn.ensemble <span style="color: #c099ff;">import</span> AdaBoostClassifier
<span style="color: #c099ff;">from</span> sklearn.tree <span style="color: #c099ff;">import</span> DecisionTreeClassifier
<span style="color: #c099ff;">from</span> sklearn.metrics <span style="color: #c099ff;">import</span> accuracy_score

<span style="color: #ff98a4;">train_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">train_label</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_label</span> = <span style="color: #ff995e;">None</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org86288ea" class="outline-4">
<h4 id="org86288ea"><span class="section-number-4">2.2.2.</span> Initializing global variables</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
The way I&rsquo;ve modeled the data for this meta classifier, forms a vector from concatenating vector of each image, In other words imagine we have extracted parts of people&rsquo;s DNA and we want to know whether they are related or not, First we form a table containing DNA parts of each of those people&rsquo;s DNA in each row and we want our decision tree to figure out existence of any blood relationship. We are doing the samething here, each vector being image&rsquo;s DNA and their concatenation being each row. We transform the data into our desired shape and then use this function to load them.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">init_vars</span>(_train_data, _train_label, _test_data, _test_label):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Initializez global variables</span>
    <span style="color: #c099ff;">global</span> train_data
    <span style="color: #c099ff;">global</span> train_label
    <span style="color: #c099ff;">global</span> test_data
    <span style="color: #c099ff;">global</span> test_label
    <span style="color: #ff98a4;">train_data</span> = _train_data
    <span style="color: #ff98a4;">train_label</span> = _train_label
    <span style="color: #ff98a4;">test_data</span> = _test_data
    <span style="color: #ff98a4;">test_label</span> = _test_label
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cd359c" class="outline-4">
<h4 id="org1cd359c"><span class="section-number-4">2.2.3.</span> Initializing the meta classifier</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
First we need to construct a decision tree classifier with our desired parameters and then passing that to our meta classifier and at the end train the meta classifier and the measure its performance. That&rsquo;s what we do for all of meta classifiers in this project.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">get_populated_dtc</span>(max_depth=<span style="color: #ff995e; font-weight: bold;">8</span>, min_samples_split=<span style="color: #ff995e; font-weight: bold;">2</span>, min_samples_leaf=<span style="color: #ff995e; font-weight: bold;">4</span>, min_impurity_decrease=<span style="color: #ff995e; font-weight: bold;">0.0</span>):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Return a DecisionTreeClassifier object</span>
    <span style="color: #ff98a4;">dtc</span> = DecisionTreeClassifier(max_depth=max_depth, min_samples_split=min_samples_split, min_samples_leaf=min_samples_leaf, min_impurity_decrease=min_impurity_decrease)
    <span style="color: #c099ff;">return</span> dtc

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">adaboosted_dt</span>():
    <span style="color: #ff98a4;">ab_dt</span> = AdaBoostClassifier(
        get_populated_dtc(), n_estimators=<span style="color: #ff995e; font-weight: bold;">100</span>
    )

    <span style="color: #c099ff;">return</span> ab_dt.fit(train_data, train_label)

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">test_accuracy</span>(trained_model):
    <span style="color: #ff98a4;">test1</span> = accuracy_score(test_label, trained_model.predict(test_data))
    <span style="color: #ff98a4;">train1</span> = accuracy_score(train_label, trained_model.predict(train_data))
    <span style="color: #c099ff;">return</span> test1, train1
</pre>
</div>
<p>
I&rsquo;ll talk about its results and performance at the end of this document.
</p>
</div>
</div>
</div>
