docs/documentation.html
<div id="outline-container-orga5e186e" class="outline-3">
<h3 id="orga5e186e"><span class="section-number-3">2.3.</span> Random Forrest</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgee7338b" class="outline-4">
<h4 id="orgee7338b"><span class="section-number-4">2.3.1.</span> Needed modules and global variables</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">from</span> sklearn.ensemble <span style="color: #c099ff;">import</span> RandomForestClassifier
<span style="color: #c099ff;">from</span> sklearn.metrics <span style="color: #c099ff;">import</span> accuracy_score
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np

<span style="color: #ff98a4;">train_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">train_label</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_label</span> = <span style="color: #ff995e;">None</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff51216" class="outline-4">
<h4 id="orgff51216"><span class="section-number-4">2.3.2.</span> Initializing global variables</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Here I&rsquo;ve experimented with a different way of modeling data, I&rsquo;ve imagined that each vector is not just an array of features but it actually represents and actual vector in a 512 dimension and their differences and their distance can mean something, So this time I create a vector of size 513 which its first 512 elements are absolute value of two vectors and its last element is their distance.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">preprocess_data</span>(d):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Calculate vector distance and absolute value of their difference</span>
    <span style="color: #ff98a4;">res1</span> = []
    <span style="color: #ff98a4;">res2</span> = []
    <span style="color: #c099ff;">for</span> data <span style="color: #c099ff;">in</span> d:
        <span style="color: #ff98a4;">res</span> = np.subtract(data[<span style="color: #ff995e; font-weight: bold;">0</span>], data[<span style="color: #ff995e; font-weight: bold;">1</span>])
        res1.append(np.<span style="color: #c099ff;">abs</span>(res))
        res2.append(np.linalg.norm(res))
    <span style="color: #ff98a4;">res</span> = [np.append(x, y) <span style="color: #c099ff;">for</span> x, y <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">zip</span>(res1, res2)]
    <span style="color: #c099ff;">return</span> np.array(res)

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">init_vars</span>(_train_data, _train_label, _test_data, _test_label):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Initializez global variables</span>
    <span style="color: #c099ff;">global</span> train_data
    <span style="color: #c099ff;">global</span> train_label
    <span style="color: #c099ff;">global</span> test_data
    <span style="color: #c099ff;">global</span> test_label
    <span style="color: #ff98a4;">train_data</span> = _train_data.reshape(<span style="color: #c099ff;">len</span>(_train_data), <span style="color: #ff995e; font-weight: bold;">2</span>, -<span style="color: #ff995e; font-weight: bold;">1</span>)
    <span style="color: #ff98a4;">train_label</span> = _train_label
    <span style="color: #ff98a4;">test_data</span> = _test_data.reshape(<span style="color: #c099ff;">len</span>(_test_data), <span style="color: #ff995e; font-weight: bold;">2</span>, -<span style="color: #ff995e; font-weight: bold;">1</span>)
    <span style="color: #ff98a4;">test_label</span> = _test_label
    <span style="color: #ff98a4;">train_data</span> = preprocess_data(train_data)
    <span style="color: #ff98a4;">test_data</span> = preprocess_data(test_data)
</pre>
</div>
</div>
</div>
<div id="outline-container-org081db88" class="outline-4">
<h4 id="org081db88"><span class="section-number-4">2.3.3.</span> Initializing the meta classifier</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">test_accuracy</span>(trained_model):
    <span style="color: #ff98a4;">test1</span> = accuracy_score(test_label, trained_model.predict(test_data))
    <span style="color: #ff98a4;">train1</span> = accuracy_score(train_label, trained_model.predict(train_data))
    <span style="color: #c099ff;">return</span> test1, train1

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">handle_random_forrest</span>():
    <span style="color: #ff98a4;">rfc</span> = RandomForestClassifier(max_depth=<span style="color: #ff995e; font-weight: bold;">8</span>, min_samples_split=<span style="color: #ff995e; font-weight: bold;">2</span>, min_samples_leaf=<span style="color: #ff995e; font-weight: bold;">4</span>, min_impurity_decrease=<span style="color: #ff995e; font-weight: bold;">0.0</span>)
    <span style="color: #c099ff;">return</span> rfc.fit(train_data, train_label)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d3863c" class="outline-3">
<h3 id="org3d3863c"><span class="section-number-3">2.4.</span> Bagged MLPs</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgfe4ff2c" class="outline-4">
<h4 id="orgfe4ff2c"><span class="section-number-4">2.4.1.</span> Needed modules and global variables</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">from</span> sklearn.ensemble <span style="color: #c099ff;">import</span> BaggingClassifier
<span style="color: #c099ff;">from</span> sklearn.neural_network <span style="color: #c099ff;">import</span> MLPClassifier
<span style="color: #c099ff;">from</span> sklearn.metrics <span style="color: #c099ff;">import</span> accuracy_score, adjusted_rand_score

<span style="color: #ff98a4;">train_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">train_label</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_label</span> = <span style="color: #ff995e;">None</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org11076f6" class="outline-4">
<h4 id="org11076f6"><span class="section-number-4">2.4.2.</span> Initializing global variables</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Here I&rsquo;ve used the same modeling as what I used in Adaboosted Decision Trees.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">init_vars</span>(_train_data, _train_label, _test_data, _test_label):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Initializez global variables</span>
    <span style="color: #c099ff;">global</span> train_data
    <span style="color: #c099ff;">global</span> train_label
    <span style="color: #c099ff;">global</span> test_data
    <span style="color: #c099ff;">global</span> test_label
    <span style="color: #ff98a4;">train_data</span> = _train_data
    <span style="color: #ff98a4;">train_label</span> = _train_label
    <span style="color: #ff98a4;">test_data</span> = _test_data
    <span style="color: #ff98a4;">test_label</span> = _test_label
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7ebd80" class="outline-4">
<h4 id="orgf7ebd80"><span class="section-number-4">2.4.3.</span> Initializing the meta classifier</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">get_populated_mlpc</span>():
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Return a MLPClassifier object</span>
    <span style="color: #ff98a4;">mlpc</span> = MLPClassifier()
    mlpc.set_params(hidden_layer_sizes=(<span style="color: #ff995e; font-weight: bold;">200</span>, <span style="color: #ff995e; font-weight: bold;">80</span>, <span style="color: #ff995e; font-weight: bold;">20</span>), alpha=<span style="color: #ff995e; font-weight: bold;">0.032</span>, random_state=<span style="color: #ff995e; font-weight: bold;">1</span>, solver=<span style="color: #c3e88d;">"adam"</span>, activation=<span style="color: #c3e88d;">"relu"</span>, max_iter=<span style="color: #ff995e; font-weight: bold;">500</span>)
    <span style="color: #c099ff;">return</span> mlpc

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">bagged_mlp</span>():
    <span style="color: #ff98a4;">bg_mlpc</span> = BaggingClassifier(base_estimator= get_populated_mlpc(), n_estimators=<span style="color: #ff995e; font-weight: bold;">20</span>, random_state=<span style="color: #ff995e; font-weight: bold;">1</span>, n_jobs=<span style="color: #ff995e; font-weight: bold;">12</span>)
    <span style="color: #c099ff;">return</span> bg_mlpc.fit(train_data, train_label)

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">test_accuracy</span>(trained_model):
    <span style="color: #ff98a4;">test1</span> = accuracy_score(test_label, trained_model.predict(test_data))
    <span style="color: #ff98a4;">train1</span> = accuracy_score(train_label, trained_model.predict(train_data))
    <span style="color: #c099ff;">return</span> test1, train1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7397c33" class="outline-3">
<h3 id="org7397c33"><span class="section-number-3">2.5.</span> Some sort of bootstraping + Soft voting</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Here I&rsquo;ve taken advantage of three different classifiers:
</p>
<ol class="org-ol">
<li>SVM</li>
<li>MLP</li>
<li>DT</li>
</ol>
<p>
I loop over them and in each iteration train them on a random subset of dataset and modify an array of weights based on their performance and at the very end I pass them to a VotingClassifier and train that meta classifier on the whole dataset.
</p>
</div>
<div id="outline-container-orge1c281e" class="outline-4">
<h4 id="orge1c281e"><span class="section-number-4">2.5.1.</span> Needed modules and global variables</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">from</span> sklearn.neural_network <span style="color: #c099ff;">import</span> MLPClassifier
<span style="color: #c099ff;">from</span> sklearn.tree <span style="color: #c099ff;">import</span> DecisionTreeClassifier
<span style="color: #c099ff;">from</span> sklearn.svm <span style="color: #c099ff;">import</span> SVC
<span style="color: #c099ff;">from</span> sklearn.ensemble <span style="color: #c099ff;">import</span> VotingClassifier

<span style="color: #c099ff;">from</span> sklearn.metrics <span style="color: #c099ff;">import</span> accuracy_score
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np

<span style="color: #ff98a4;">train_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">train_label</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_data</span> = <span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">test_label</span> = <span style="color: #ff995e;">None</span>
</pre>
</div>
</div>
</div>
