docs/documentation.html
<div id="outline-container-orgd065574" class="outline-4">
<h4 id="orgd065574"><span class="section-number-4">2.5.2.</span> Initializing global variables</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Here I&rsquo;ve used same modeling as RandomForrest.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">preprocess_data</span>(d):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Calculate vector distance and absolute value of their difference</span>
    <span style="color: #ff98a4;">res1</span> = []
    <span style="color: #ff98a4;">res2</span> = []
    <span style="color: #c099ff;">for</span> data <span style="color: #c099ff;">in</span> d:
        <span style="color: #ff98a4;">res</span> = np.subtract(data[<span style="color: #ff995e; font-weight: bold;">0</span>], data[<span style="color: #ff995e; font-weight: bold;">1</span>])
        res1.append(np.<span style="color: #c099ff;">abs</span>(res))
        res2.append(np.linalg.norm(res))
    <span style="color: #ff98a4;">res</span> = [np.append(x, y) <span style="color: #c099ff;">for</span> x, y <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">zip</span>(res1, res2)]
    <span style="color: #c099ff;">return</span> np.array(res)

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">init_vars</span>(_train_data, _train_label, _test_data, _test_label):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Initializez global variables</span>
    <span style="color: #c099ff;">global</span> train_data
    <span style="color: #c099ff;">global</span> train_label
    <span style="color: #c099ff;">global</span> test_data
    <span style="color: #c099ff;">global</span> test_label
    <span style="color: #ff98a4;">train_data</span> = _train_data.reshape(<span style="color: #c099ff;">len</span>(_train_data), <span style="color: #ff995e; font-weight: bold;">2</span>, -<span style="color: #ff995e; font-weight: bold;">1</span>)
    <span style="color: #ff98a4;">train_label</span> = _train_label
    <span style="color: #ff98a4;">test_data</span> = _test_data.reshape(<span style="color: #c099ff;">len</span>(_test_data), <span style="color: #ff995e; font-weight: bold;">2</span>, -<span style="color: #ff995e; font-weight: bold;">1</span>)
    <span style="color: #ff98a4;">test_label</span> = _test_label
    <span style="color: #ff98a4;">train_data</span> = preprocess_data(train_data)
    <span style="color: #ff98a4;">test_data</span> = preprocess_data(test_data)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d0ef9f" class="outline-4">
<h4 id="org0d0ef9f"><span class="section-number-4">2.5.3.</span> The pipeline</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">get_random_samples</span>(number_of_samples=<span style="color: #ff995e; font-weight: bold;">3</span>):
    <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">Return a list of random samples from dataset</span>
    <span style="color: #ff98a4;">res</span> = []
    <span style="color: #c099ff;">for</span> _ <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span>(number_of_samples):
        <span style="color: #ff98a4;">indexes</span> = np.random.choice(<span style="color: #c099ff;">len</span>(train_data), size=(<span style="color: #c099ff;">int</span>(<span style="color: #c099ff;">len</span>(train_data) / number_of_samples)), replace=<span style="color: #ff995e;">False</span>)
        res.append(indexes)
    <span style="color: #c099ff;">return</span> res

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">test_accuracy_pipeline</span>(trained_model):
    <span style="color: #ff98a4;">test1</span> = accuracy_score(test_label, trained_model.predict(test_data))
    <span style="color: #c099ff;">return</span> test1

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">test_accuracy</span>(trained_model):
    <span style="color: #ff98a4;">test1</span> = accuracy_score(test_label, trained_model.predict(test_data))
    <span style="color: #ff98a4;">train1</span> = accuracy_score(train_label, trained_model.predict(train_data))
    <span style="color: #c099ff;">return</span> test1, train1

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">pipeline</span>(debug=<span style="color: #ff995e;">False</span>):
    <span style="color: #ff98a4;">svm</span> = SVC(decision_function_shape=<span style="color: #c3e88d;">"ovr"</span>, kernel=<span style="color: #c3e88d;">"rbf"</span>, probability=<span style="color: #ff995e;">True</span>)
    <span style="color: #ff98a4;">mlp</span> = MLPClassifier(hidden_layer_sizes=(<span style="color: #ff995e; font-weight: bold;">40</span>, <span style="color: #ff995e; font-weight: bold;">30</span>, <span style="color: #ff995e; font-weight: bold;">20</span>, <span style="color: #ff995e; font-weight: bold;">30</span>, <span style="color: #ff995e; font-weight: bold;">40</span>), alpha=<span style="color: #ff995e; font-weight: bold;">0.032</span>, random_state=<span style="color: #ff995e; font-weight: bold;">1</span>, solver=<span style="color: #c3e88d;">"adam"</span>, activation=<span style="color: #c3e88d;">"relu"</span>, max_iter=<span style="color: #ff995e; font-weight: bold;">500</span>)
    <span style="color: #ff98a4;">dt</span> = DecisionTreeClassifier(max_depth=<span style="color: #ff995e; font-weight: bold;">64</span>, min_samples_split=<span style="color: #ff995e; font-weight: bold;">2</span>, min_samples_leaf=<span style="color: #ff995e; font-weight: bold;">4</span>, min_impurity_decrease=<span style="color: #ff995e; font-weight: bold;">0.0</span>)
    <span style="color: #ff98a4;">weights</span> = [<span style="color: #ff995e; font-weight: bold;">1</span> / <span style="color: #ff995e; font-weight: bold;">3</span>, <span style="color: #ff995e; font-weight: bold;">1</span> / <span style="color: #ff995e; font-weight: bold;">3</span>, <span style="color: #ff995e; font-weight: bold;">1</span> / <span style="color: #ff995e; font-weight: bold;">3</span>]
    <span style="color: #ff98a4;">last_acc</span> = [<span style="color: #ff995e; font-weight: bold;">0</span>, <span style="color: #ff995e; font-weight: bold;">0</span>, <span style="color: #ff995e; font-weight: bold;">0</span>]
    <span style="color: #c099ff;">for</span> _ <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span>(<span style="color: #ff995e; font-weight: bold;">10</span>):
        <span style="color: #ff98a4;">samples</span> = get_random_samples()
        svm.fit(train_data[samples[<span style="color: #ff995e; font-weight: bold;">0</span>]], train_label[samples[<span style="color: #ff995e; font-weight: bold;">0</span>]])
        mlp.fit(train_data[samples[<span style="color: #ff995e; font-weight: bold;">1</span>]], train_label[samples[<span style="color: #ff995e; font-weight: bold;">1</span>]])
        dt.fit(train_data[samples[<span style="color: #ff995e; font-weight: bold;">2</span>]], train_label[samples[<span style="color: #ff995e; font-weight: bold;">2</span>]])
        <span style="color: #ff98a4;">svm_acc</span> = test_accuracy_pipeline(svm)
        <span style="color: #ff98a4;">mlp_acc</span> = test_accuracy_pipeline(mlp)
        <span style="color: #ff98a4;">dt_acc</span> = test_accuracy_pipeline(dt)
        <span style="color: #c099ff;">if</span> svm_acc &lt; last_acc[<span style="color: #ff995e; font-weight: bold;">0</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">0</span>] -= <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #c099ff;">elif</span> mlp_acc &lt; last_acc[<span style="color: #ff995e; font-weight: bold;">1</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">1</span>] -= <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #c099ff;">elif</span> dt_acc &lt; last_acc[<span style="color: #ff995e; font-weight: bold;">2</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">2</span>] -= <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #c099ff;">if</span> svm_acc &gt; last_acc[<span style="color: #ff995e; font-weight: bold;">0</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">0</span>] += <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #c099ff;">elif</span> mlp_acc &gt; last_acc[<span style="color: #ff995e; font-weight: bold;">1</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">1</span>] += <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #c099ff;">elif</span> dt_acc &gt; last_acc[<span style="color: #ff995e; font-weight: bold;">2</span>]:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">2</span>] += <span style="color: #ff995e; font-weight: bold;">0.05</span>
        <span style="color: #ff98a4;">last_acc</span> = [svm_acc, mlp_acc, dt_acc]
        <span style="color: #c099ff;">if</span> debug:
            <span style="color: #c099ff;">print</span>(<span style="color: #c3e88d;">"**SVM: {}, MLP: {}, DT: {}**"</span>.<span style="color: #c099ff;">format</span>(svm_acc, mlp_acc, dt_acc))
        <span style="color: #ff98a4;">svm_acc</span> = svm_acc * weights[<span style="color: #ff995e; font-weight: bold;">0</span>]
        <span style="color: #ff98a4;">mlp_acc</span> = mlp_acc * weights[<span style="color: #ff995e; font-weight: bold;">1</span>]
        <span style="color: #ff98a4;">dt_acc</span> = dt_acc * weights[<span style="color: #ff995e; font-weight: bold;">2</span>]
        <span style="color: #c099ff;">if</span> debug:
            <span style="color: #c099ff;">print</span>(<span style="color: #c3e88d;">"##SVM: {}, MLP: {}, DT: {}##"</span>.<span style="color: #c099ff;">format</span>(svm_acc, mlp_acc, dt_acc))
        <span style="color: #c099ff;">if</span> svm_acc &gt; mlp_acc <span style="color: #c099ff;">and</span> svm_acc &gt; dt_acc:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">0</span>] += <span style="color: #ff995e; font-weight: bold;">0.1</span>
        <span style="color: #c099ff;">elif</span> mlp_acc &gt; svm_acc <span style="color: #c099ff;">and</span> mlp_acc &gt; dt_acc:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">1</span>] += <span style="color: #ff995e; font-weight: bold;">0.1</span>
        <span style="color: #c099ff;">elif</span> dt_acc &gt; svm_acc <span style="color: #c099ff;">and</span> dt_acc &gt; mlp_acc:
            <span style="color: #ff98a4;">weights</span>[<span style="color: #ff995e; font-weight: bold;">2</span>] += <span style="color: #ff995e; font-weight: bold;">0.1</span>


    <span style="color: #ff98a4;">vt_svm_mlp_dt</span> = VotingClassifier(estimators=[
        (<span style="color: #c3e88d;">'svm'</span>, svm), (<span style="color: #c3e88d;">'mlp'</span>, mlp), (<span style="color: #c3e88d;">'dt'</span>, dt)],
        voting=<span style="color: #c3e88d;">'soft'</span>, weights=weights, n_jobs=<span style="color: #ff995e; font-weight: bold;">12</span>)

    <span style="color: #ff98a4;">res</span> = vt_svm_mlp_dt.fit(train_data, train_label)
    <span style="color: #c099ff;">if</span> debug:
        <span style="color: #c099ff;">print</span>(<span style="color: #c3e88d;">"Final accuracy: {}"</span>.<span style="color: #c099ff;">format</span>(test_accuracy(res)[<span style="color: #ff995e; font-weight: bold;">0</span>]))
    <span style="color: #c099ff;">return</span> res
</pre>
</div>
</div>
</div>
</div>
