docs/documentation.org
*** Needed modules
#+BEGIN_SRC python
import numpy as np
from utils.data_loader import load
import utils.ensemble_dt as edt
import utils.ensemble_bag_mlp as ebm
import utils.svm_mlp_dt_combo as smdt
import utils.ensemble_rf as erf
from sklearn import preprocessing
from tabulate import tabulate
#+END_SRC
*** Loading and manuplating the data
Here I transform loaded data into the form I explained in AdaBoostClassifier section.
#+BEGIN_SRC python
train_plus, train_negative, test_plus, test_negative = load("/home/toorajtaraz/Downloads/project/")
train_data_count = train_plus.shape[0]
test_data_count = test_plus.shape[0]

train_plus = train_plus.reshape((train_data_count, -1))
train_negative = train_negative.reshape((train_data_count, -1))
test_plus = test_plus.reshape((test_data_count, -1))
test_negative = test_negative.reshape((test_data_count, -1))

train_data = []
train_label = []

test_data = []
test_label = []

for x in train_plus:
    train_data.append(x)
    train_label.append(1)

for x in train_negative:
    train_data.append(x)
    train_label.append(0)

for x in test_plus:
    test_data.append(x)
    test_label.append(1)

for x in test_negative:
    test_data.append(x)
    test_label.append(0)

test_data = np.array(test_data)
train_data = np.array(train_data)
test_label = np.array(test_label)
train_label = np.array(train_label)
#+END_SRC
*** Preprocessing data
Sklearn Library offers a module that takes care of standardizing the data, this action improves convergence time and accuracy (at least based on what I witnessed).
#+BEGIN_SRC python
scaler = preprocessing.StandardScaler().fit(train_data)
train_data = scaler.transform(train_data)

scaler = preprocessing.StandardScaler().fit(test_data)
test_data = scaler.transform(test_data)
#+END_SRC
*** Using what have created so far
#+BEGIN_SRC python
edt.init_vars(train_data, train_label, test_data, test_label)
adaboosted_dt_acc = edt.test_accuracy(edt.adaboosted_dt())

ebm.init_vars(train_data, train_label, test_data, test_label)
bagged_mlp_acc = ebm.test_accuracy(ebm.bagged_mlp())

smdt.init_vars(train_data, train_label, test_data, test_label)
svm_mlp_dt_combo_acc = smdt.test_accuracy(smdt.pipeline(debug=True))

erf.init_vars(train_data, train_label, test_data, test_label)
random_forrest_acc = erf.test_accuracy(erf.handle_random_forrest())
#+END_SRC
** Results
*** Overall view
+----------------------+------+--------+
|TYPE                  |TEST_P|TRAIN_P |
+----------------------+------+--------+
|AdaboostedDecisionTree|0.578 |   1    |
+----------------------+------+--------+
|      BaggedMLP       |0.766 |0.997273|
+----------------------+------+--------+
|      SVM_MLP_DT      |0.844 |0.963636|
+----------------------+------+--------+
|     RandomForest     | 0.81 |0.985909|
+----------------------+------+--------+
*** Detailed discussion
In case of AdaboostedDecisionTree, it performed as I excepted, very well on train dataset and poorly on test dataset due to over fitting.
BaggedMLPs didn't perform very well as excepted, just about 2000 data samples are not enough for training a MLP. At first I intended to extract data from dataset folder and train my model on a larger dataset, but I figured due to our point being related to the accuracy we achieve it wouldn't be ethical :))
RandomForest and my customish algorithm performed better than the others.
During my tests I concluded that SVM with RBF kernel performs the best and the ensemble final accuracy is really close to SVM's accuracy, but I assume it wouldn't be the case if we had a large enough dataset, in that case MLP would be the dominant model in voting.
