docs/documentation.html

<div id="outline-container-org7feaf7f" class="outline-3">
<h3 id="org7feaf7f"><span class="section-number-3">2.6.</span> The main script</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org90e5cf6" class="outline-4">
<h4 id="org90e5cf6"><span class="section-number-4">2.6.1.</span> Needed modules</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np
<span style="color: #c099ff;">from</span> utils.data_loader <span style="color: #c099ff;">import</span> load
<span style="color: #c099ff;">import</span> utils.ensemble_dt <span style="color: #c099ff;">as</span> edt
<span style="color: #c099ff;">import</span> utils.ensemble_bag_mlp <span style="color: #c099ff;">as</span> ebm
<span style="color: #c099ff;">import</span> utils.svm_mlp_dt_combo <span style="color: #c099ff;">as</span> smdt
<span style="color: #c099ff;">import</span> utils.ensemble_rf <span style="color: #c099ff;">as</span> erf
<span style="color: #c099ff;">from</span> sklearn <span style="color: #c099ff;">import</span> preprocessing
<span style="color: #c099ff;">from</span> tabulate <span style="color: #c099ff;">import</span> tabulate
</pre>
</div>
</div>
</div>
<div id="outline-container-org6472582" class="outline-4">
<h4 id="org6472582"><span class="section-number-4">2.6.2.</span> Loading and manuplating the data</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Here I transform loaded data into the form I explained in AdaBoostClassifier section.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff98a4;">train_plus</span>, <span style="color: #ff98a4;">train_negative</span>, <span style="color: #ff98a4;">test_plus</span>, <span style="color: #ff98a4;">test_negative</span> = load(<span style="color: #c3e88d;">"/home/toorajtaraz/Downloads/project/"</span>)
<span style="color: #ff98a4;">train_data_count</span> = train_plus.shape[<span style="color: #ff995e; font-weight: bold;">0</span>]
<span style="color: #ff98a4;">test_data_count</span> = test_plus.shape[<span style="color: #ff995e; font-weight: bold;">0</span>]

<span style="color: #ff98a4;">train_plus</span> = train_plus.reshape((train_data_count, -<span style="color: #ff995e; font-weight: bold;">1</span>))
<span style="color: #ff98a4;">train_negative</span> = train_negative.reshape((train_data_count, -<span style="color: #ff995e; font-weight: bold;">1</span>))
<span style="color: #ff98a4;">test_plus</span> = test_plus.reshape((test_data_count, -<span style="color: #ff995e; font-weight: bold;">1</span>))
<span style="color: #ff98a4;">test_negative</span> = test_negative.reshape((test_data_count, -<span style="color: #ff995e; font-weight: bold;">1</span>))

<span style="color: #ff98a4;">train_data</span> = []
<span style="color: #ff98a4;">train_label</span> = []

<span style="color: #ff98a4;">test_data</span> = []
<span style="color: #ff98a4;">test_label</span> = []

<span style="color: #c099ff;">for</span> x <span style="color: #c099ff;">in</span> train_plus:
    train_data.append(x)
    train_label.append(<span style="color: #ff995e; font-weight: bold;">1</span>)

<span style="color: #c099ff;">for</span> x <span style="color: #c099ff;">in</span> train_negative:
    train_data.append(x)
    train_label.append(<span style="color: #ff995e; font-weight: bold;">0</span>)

<span style="color: #c099ff;">for</span> x <span style="color: #c099ff;">in</span> test_plus:
    test_data.append(x)
    test_label.append(<span style="color: #ff995e; font-weight: bold;">1</span>)

<span style="color: #c099ff;">for</span> x <span style="color: #c099ff;">in</span> test_negative:
    test_data.append(x)
    test_label.append(<span style="color: #ff995e; font-weight: bold;">0</span>)

<span style="color: #ff98a4;">test_data</span> = np.array(test_data)
<span style="color: #ff98a4;">train_data</span> = np.array(train_data)
<span style="color: #ff98a4;">test_label</span> = np.array(test_label)
<span style="color: #ff98a4;">train_label</span> = np.array(train_label)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0cb99e7" class="outline-4">
<h4 id="org0cb99e7"><span class="section-number-4">2.6.3.</span> Preprocessing data</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
Sklearn Library offers a module that takes care of standardizing the data, this action improves convergence time and accuracy (at least based on what I witnessed).
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff98a4;">scaler</span> = preprocessing.StandardScaler().fit(train_data)
<span style="color: #ff98a4;">train_data</span> = scaler.transform(train_data)

<span style="color: #ff98a4;">scaler</span> = preprocessing.StandardScaler().fit(test_data)
<span style="color: #ff98a4;">test_data</span> = scaler.transform(test_data)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde6b7af" class="outline-4">
<h4 id="orgde6b7af"><span class="section-number-4">2.6.4.</span> Using what have created so far</h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">
<pre class="src src-python">edt.init_vars(train_data, train_label, test_data, test_label)
<span style="color: #ff98a4;">adaboosted_dt_acc</span> = edt.test_accuracy(edt.adaboosted_dt())

ebm.init_vars(train_data, train_label, test_data, test_label)
<span style="color: #ff98a4;">bagged_mlp_acc</span> = ebm.test_accuracy(ebm.bagged_mlp())

smdt.init_vars(train_data, train_label, test_data, test_label)
<span style="color: #ff98a4;">svm_mlp_dt_combo_acc</span> = smdt.test_accuracy(smdt.pipeline(debug=<span style="color: #ff995e;">True</span>))

erf.init_vars(train_data, train_label, test_data, test_label)
<span style="color: #ff98a4;">random_forrest_acc</span> = erf.test_accuracy(erf.handle_random_forrest())
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org10f14f8" class="outline-3">
<h3 id="org10f14f8"><span class="section-number-3">2.7.</span> Results</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgbb31424" class="outline-4">
<h4 id="orgbb31424"><span class="section-number-4">2.7.1.</span> Overall view</h4>
<div class="outline-text-4" id="text-2-7-1">
<!-- This HTML table template is generated by emacs 27.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      TYPE&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      TEST_P
    </td>
    <td align="left" valign="top">
      TRAIN_P&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      AdaboostedDecisionTree
    </td>
    <td align="left" valign="top">
      0.578&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;BaggedMLP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.766&nbsp;
    </td>
    <td align="left" valign="top">
      0.997273
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SVM_MLP_DT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.844&nbsp;
    </td>
    <td align="left" valign="top">
      0.963636
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;RandomForest&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.81&nbsp;
    </td>
    <td align="left" valign="top">
      0.985909
    </td>
  </tr>
</table>
</div>
</div>
<div id="outline-container-org741a82b" class="outline-4">
<h4 id="org741a82b"><span class="section-number-4">2.7.2.</span> Detailed discussion</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
In case of AdaboostedDecisionTree, it performed as I excepted, very well on train dataset and poorly on test dataset due to over fitting.
BaggedMLPs didn&rsquo;t perform very well as excepted, just about 2000 data samples are not enough for training a MLP. At first I intended to extract data from dataset folder and train my model on a larger dataset, but I figured due to our point being related to the accuracy we achieve it wouldn&rsquo;t be ethical :))
RandomForest and my customish algorithm performed better than the others.
During my tests I concluded that SVM with RBF kernel performs the best and the ensemble final accuracy is really close to SVM&rsquo;s accuracy, but I assume it wouldn&rsquo;t be the case if we had a large enough dataset, in that case MLP would be the dominant model in voting.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tooraj Taraz</p>
<p class="date">Created: 2022-02-02 Wed 20:01</p>
</div>
</body>
</html>
